IDEA Open Model
CrossSectionFactory.FillColdFormedLgen Method
Compatible with IDEA StatiCa Beta 20.0
 Fill parameters for cold formed L - gen section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillColdFormedLgen(
	CrossSectionParameter css,
	double Width,
	double Height,
	double Angle,
	double Thickness,
	double Radius
)
Public Shared Sub FillColdFormedLgen (
	css As CrossSectionParameter,
	Width As Double,
	Height As Double,
	Angle As Double,
	Thickness As Double,
	Radius As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width
Type: System.Double
Horizontal leg length
Height
Type: System.Double
Vertical leg length
Angle
Type: System.Double
Angle between legs
Thickness
Type: System.Double
Thickness
Radius
Type: System.Double
Inside radius
Remarks
Dimension of cold formed L - gen section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 10;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Angle = Math.PI / 2.0;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedLgen(css, Width, Height, Angle, Thickness, Radius);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace